app/controllers/directors_controller.rb

  def index #shows the list of directors of the currently selected movie
    @movie = Movie.find(params[:movie_id])
---
SELECT "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def show
     @movie = Movie.find(params[:movie_id])
---
SELECT "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def edit
     @movie = Movie.find(params[:movie_id])
---
SELECT "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def create
           @movie = Movie.find(params[:movie_id])
      @director = @movie.build_director(director_params)
      respond_to do |format|
      if @director.save
---
SELECT "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "directors" ("firstname", "lastname", "movie_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["firstname", "Joe"], ["lastname", "Russo"], ["movie_id", 1], ["created_at", "2019-10-11 17:36:41.256887"], ["updated_at", "2019-10-11 17:36:41.256887"]]

  def update
     @movie = Movie.find(params[:movie_id])
      @director = @movie.director
      respond_to do |format|
      if @director.update(director_params)
---
SELECT "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "directors" SET "firstname" = ?, "lastname" = ?, "updated_at" = ? WHERE "directors"."id" = ?  [["firstname", "Russo"], ["lastname", "Brothers"], ["updated_at", "2019-10-11 17:59:50.203223"], ["id", 2]]

  def destroy
     @movie = Movie.find(params[:movie_id])
   @director = @movie.director
   @director.destroy
---
SELECT "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "directors" WHERE "directors"."id" = ?  [["id", 1]]

    def set_director
      @director = Director.find(params[:id])
---
SELECT "directors".* FROM "directors" WHERE "directors"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]