app/controllers/movies_controller.rb

SELECT "movies".* FROM "movies" WHERE (release=='2019')
SELECT "movies".* FROM "movies" OUTER JOIN directors ON directors.movie_id = movies.id AND directors.firstname = 'Russo'
---
  def index
    @movies = Movie.all

    @best = Movie.where("release==?","2019")  #SQL Query to retrieve movie with release date equal to 2019
    @best.each { |movie|
      puts  movie.name
     }
        #SQL JOIN to retrieve movie with director name equal to Russo
     @join = Movie.joins("INNER JOIN directors ON directors.movie_id = movies.id AND directors.firstname = 'Russo' ");
     @join.each   { |mov|

INSERT INTO "movies" ("name", "rating", "release", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "Avengers: Endgame"], ["rating", "9.0"], ["release", "2019"], ["created_at", "2019-10-11 16:32:25.709417"], ["updated_at", "2019-10-11 16:32:25.709417"]]
---
  def create
    @movie = Movie.new(movie_params)

    respond_to do |format|
      if @movie.save

UPDATE "movies" SET "rating" = ?, "updated_at" = ? WHERE "movies"."id" = ?  [["rating", "9.5"], ["updated_at", "2019-10-11 16:34:58.638068"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @movie.update(movie_params)