app/controllers/reviews_controller.rb

  def index
     @movie = Movie.find(params[:movie_id])
---
SELECT "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def edit
     @movie = Movie.find(params[:movie_id])
     @review = @movie.reviews.find(params[:id])
---
SELECT "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "reviews".* FROM "reviews" WHERE "reviews"."movie_id" = ? AND "reviews"."id" = ? LIMIT ?  [["movie_id", 1], ["id", 2], ["LIMIT", 1]]

  def show
     @movie = Movie.find(params[:movie_id])
     @review = @movie.reviews.find(params[:id])
---
SELECT "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "reviews".* FROM "reviews" WHERE "reviews"."movie_id" = ? AND "reviews"."id" = ? LIMIT ?  [["movie_id", 1], ["id", 1], ["LIMIT", 1]]

  def new
     @movie = Movie.find(params[:movie_id])
---
SELECT "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def create
     @movie = Movie.find(params[:movie_id])
     @review = @movie.reviews.build(params.require(:review).permit(:details))
     if @review.save
---
SELECT "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "reviews" ("details", "movie_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["details", "Wonderful Experience"], ["movie_id", 1], ["created_at", "2019-10-11 16:37:42.709153"], ["updated_at", "2019-10-11 16:37:42.709153"]]

  def update
     @movie = Movie.find(params[:movie_id])
     @review = @movie.reviews.find(params[:id])
     if @review.update_attributes(params.require(:review).permit(:details))
---
SELECT "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "reviews".* FROM "reviews" WHERE "reviews"."movie_id" = ? AND "reviews"."id" = ? LIMIT ?  [["movie_id", 1], ["id", 2], ["LIMIT", 1]]
UPDATE "reviews" SET "details" = ?, "updated_at" = ? WHERE "reviews"."id" = ?  [["details", "Cool Movie"], ["updated_at", "2019-10-11 16:39:03.228073"], ["id", 2]]

  def destroy
     @movie = Movie.find(params[:movie_id])
     @review = @movie.reviews.find(params[:id])

     @review.destroy
---
SELECT "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "reviews".* FROM "reviews" WHERE "reviews"."movie_id" = ? AND "reviews"."id" = ? LIMIT ?  [["movie_id", 1], ["id", 1], ["LIMIT", 1]]
DELETE FROM "reviews" WHERE "reviews"."id" = ?  [["id", 1]]